RASC186/channel-analyzer-fw/Channel Analyzer.cydsn/Generated_Source/PSoC6/VDAC_DMA.h
/***************************************
*    Global Variables
***************************************/
extern uint8_t VDAC_DMA_initVar;

extern const cy_stc_dma_descriptor_config_t VDAC_DMA_vdacDmaDescriptor_config;
extern cy_stc_dma_descriptor_t VDAC_DMA_vdacDmaDescriptor;



/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: VDAC_DMA_Stop
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void VDAC_DMA_Stop(void)
{
    Cy_DMA_Channel_Disable(VDAC_DMA_HW, VDAC_DMA_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: VDAC_DMA_ChannelEnable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Enable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void VDAC_DMA_ChannelEnable(void)
{
    Cy_DMA_Channel_Enable(VDAC_DMA_HW, VDAC_DMA_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: VDAC_DMA_ChannelDisable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void VDAC_DMA_ChannelDisable(void)
{
    Cy_DMA_Channel_Disable(VDAC_DMA_HW, VDAC_DMA_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: VDAC_DMA_SetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void VDAC_DMA_SetDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Channel_SetDescriptor(VDAC_DMA_HW, VDAC_DMA_DW_CHANNEL, descriptor);
}


/*******************************************************************************
* Function Name: VDAC_DMA_GetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetCurrentDescriptor() PDL driver function.
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * VDAC_DMA_GetDescriptor(void)
{
    return(Cy_DMA_Channel_GetCurrentDescriptor(VDAC_DMA_HW, VDAC_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: VDAC_DMA_SetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void VDAC_DMA_SetNextDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Descriptor_SetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(VDAC_DMA_HW, VDAC_DMA_DW_CHANNEL), descriptor);
}


/*******************************************************************************
* Function Name: VDAC_DMA_GetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * VDAC_DMA_GetNextDescriptor(void)
{
    return(Cy_DMA_Descriptor_GetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(VDAC_DMA_HW, VDAC_DMA_DW_CHANNEL)));
}


/*******************************************************************************
* Function Name: VDAC_DMA_SetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetPriority() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void VDAC_DMA_SetPriority(uint32_t priority)
{
    Cy_DMA_Channel_SetPriority(VDAC_DMA_HW, VDAC_DMA_DW_CHANNEL, priority);
}


/*******************************************************************************
* Function Name: VDAC_DMA_GetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetPriority() PDL driver function.  
*******************************************************************************/
__STATIC_INLINE uint32_t VDAC_DMA_GetPriority(void)
{
    return (Cy_DMA_Channel_GetPriority(VDAC_DMA_HW, VDAC_DMA_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: VDAC_DMA_SetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void VDAC_DMA_SetSrcAddress(cy_stc_dma_descriptor_t * descriptor, void const * srcAddress)
{
    Cy_DMA_Descriptor_SetSrcAddress(descriptor, srcAddress);
}


/*******************************************************************************
* Function Name: VDAC_DMA_GetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void * VDAC_DMA_GetSrcAddress(cy_stc_dma_descriptor_t const * descriptor)
{
    return(Cy_DMA_Descriptor_GetSrcAddress(descriptor));
}


/*******************************************************************************
* Function Name: VDAC_DMA_SetDstAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetDstAddress() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void VDAC_DMA_SetDstAddress(cy_stc_dma_descriptor_t * descriptor, void const * dstAddress)
{
    Cy_DMA_Descriptor_SetDstAddress(descriptor, dstAddress);
}


